# St7SetWindowBackgroundMode

Sets the background mode of the model window.

long St7SetWindowBackgroundMode(long uID, long WindowMode, long BackgroundMode)
Input Parameters
uID
Strand7 model file ID.
WindowMode
Either wmPreProcessing or wmPostProcessing.
BackgroundMode
One of bgSolid, bgImage, bgGradient or bgImageGradient.